InformationRegisters/СертификатыУчетныхЗаписейЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СертификатыУчетныхЗаписейЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействителенДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МашиночитаемаяДоверенность</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СертификатыУчетныхЗаписейЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Регистрирует данные к обновлению в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ПолноеИмяРегистра = Метаданные.РегистрыСведений.СертификатыУчетныхЗаписейЭДО.ПолноеИмя();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	ПараметрыВыборки.ПолныеИменаРегистров = Метаданные.РегистрыСведений.СертификатыУчетныхЗаписейЭДО.ПолноеИмя();
	
	ОтработаныВсеДанные = Ложь;
	
	ИдентификаторЭДО = Неопределено;
	Сертификат = Неопределено;
	
	Пока Не ОтработаныВсеДанные Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
			|	СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
			|	СертификатыУчетныхЗаписейЭДО.Сертификат КАК Сертификат
			|ИЗ
			|	РегистрСведений.СертификатыУчетныхЗаписейЭДО КАК СертификатыУчетныхЗаписейЭДО
			|ГДЕ
			|	СертификатыУчетныхЗаписейЭДО.Должность = """"
			|	И СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО > &ИдентификаторЭДО
			|	И СертификатыУчетныхЗаписейЭДО.Сертификат > &Сертификат
			|
			|УПОРЯДОЧИТЬ ПО
			|	ИдентификаторЭДО,
			|	Сертификат";
		
		Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
		Запрос.УстановитьПараметр("Сертификат", Сертификат);
		
		Данные = Запрос.Выполнить().Выгрузить();
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные, ДополнительныеПараметры);
		
		КоличествоСтрокТаблицы = Данные.Количество();
		Если КоличествоСтрокТаблицы < 1000 Тогда
			ОтработаныВсеДанные = Истина;
		КонецЕсли;
		
		Если КоличествоСтрокТаблицы > 0 Тогда
			ИдентификаторЭДО = Данные[КоличествоСтрокТаблицы - 1].ИдентификаторЭДО;
			Сертификат = Данные[КоличествоСтрокТаблицы - 1].Сертификат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обрабатывает данные, зарегистрированные в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.СертификатыУчетныхЗаписейЭДО;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	ПараметрыОтметкиВыполнения = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	
	ОбработанныхОбъектов = 0;
	ПроблемныхОбъектов = 0;
	
	ТаблицаДанных = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если Не ЗначениеЗаполнено(ТаблицаДанных) Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	Сертификаты = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаДанных, "Сертификат", Истина);
	ИдентификаторыУчетныхЗаписей = ТаблицаДанных.ВыгрузитьКолонку("ИдентификаторЭДО");
	Организации = УчетныеЗаписиЭДО.ОрганизацииУчетныхЗаписей(ИдентификаторыУчетныхЗаписей);
	
	ДолжностиИзДвоичныхДанныхСертификата = ПолучитьДожностиИзДвочиныхДанныхСертификата(Сертификаты);
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		Набор = РегистрыСведений.СертификатыУчетныхЗаписейЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторЭДО.Установить(СтрокаТаблицы.ИдентификаторЭДО);
		Набор.Отбор.Сертификат.Установить(СтрокаТаблицы.Сертификат);
		
		Если Не УчетныеЗаписиЭДОСлужебный.ТребуетсяЗаполнитьДолжностьДляСертификата(
			Организации[СтрокаТаблицы.ИдентификаторЭДО], СтрокаТаблицы.Сертификат) Тогда
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Набор, ПараметрыОтметкиВыполнения);
			ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
			Продолжить;
			
		КонецЕсли;
			
		НачатьТранзакцию();
		Попытка
			
			ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
			Набор.Прочитать();
			
			Сертификат = СтрокаТаблицы.Сертификат;
			Записать = Ложь;
			
			ДолжностьПоСертификату = ИнтеграцияБСПБЭД.ЗначенияРеквизитовСертификатаПоФамилииИмениДолжности(Сертификат).Должность;
			ДолжностьИзДвоичныхДанныхСертификата = ДолжностиИзДвоичныхДанныхСертификата[Сертификат];
			
			Если ЗначениеЗаполнено(ДолжностьПоСертификату) Тогда
				ОбработатьДанные_ЗаполнитьДолжность(Набор, ДолжностьПоСертификату, Записать);
			ИначеЕсли ЗначениеЗаполнено(ДолжностьИзДвоичныхДанныхСертификата) Тогда
				ОбработатьДанные_ЗаполнитьДолжность(Набор, ДолжностьИзДвоичныхДанныхСертификата, Записать);
			Иначе 
				ДолжностьПоДоверенности = ПолучитьДолжностьИзДоверенностейОрганизации(
											Организации[СтрокаТаблицы.ИдентификаторЭДО], Сертификат);
				ОбработатьДанные_ЗаполнитьДолжность(Набор, ДолжностьПоДоверенности, Записать);
			КонецЕсли;
			
			Если Записать Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Набор, ПараметрыОтметкиВыполнения);
			КонецЕсли;
			
			ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ШаблонСообщения = НСтр("ru = 'Не удалось заполнить должности сотрудников в учетных записях ЭДО по причине: %1 %2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Символы.ПС, ОписаниеОшибки());
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				МетаданныеОбъекта,, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбработанныхОбъектов = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые сертификаты учетных записей ЭДО (пропущены): %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция сертификатов учетных записей ЭДО: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбработанныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов =
		Параметры.ПрогрессВыполнения.ОбработаноОбъектов + ОбработанныхОбъектов;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСертификат(Знач ИдентификаторЭДО, Знач Сертификаты, ПрочитатьСписокСертификатов = Ложь) Экспорт
	
	Если ТипЗнч(Сертификаты) <> Тип("Массив") Тогда
		Сертификаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сертификаты);
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СертификатыУчетныхЗаписейЭДО");
		ЭлементБлокировкиДанных.УстановитьЗначение("ИдентификаторЭДО", ИдентификаторЭДО);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.СертификатыУчетныхЗаписейЭДО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
		
		Если ПрочитатьСписокСертификатов Тогда 
			НаборЗаписей.Прочитать();
		КонецЕсли;
		
		СертификатыДействителенДо = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сертификаты, "ДействителенДо");
		ТаблицаЗаписей = НаборЗаписей.Выгрузить();
		
		Для Каждого Сертификат Из Сертификаты Цикл 
			
			НоваяЗапись = ТаблицаЗаписей.Добавить();
			НоваяЗапись.ИдентификаторЭДО = ИдентификаторЭДО;
			НоваяЗапись.Сертификат = Сертификат;
			НоваяЗапись.ДействителенДо = СертификатыДействителенДо.Получить(Сертификат);
			
		КонецЦикла;
		
		ТаблицаЗаписей.Свернуть("ИдентификаторЭДО, Сертификат, ДействителенДо");
		
		НаборЗаписей.Загрузить(ТаблицаЗаписей);
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Информация = ИнформацияОбОшибке();
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Обновление сертификатов учетной записи'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация),
			СтрШаблон(НСтр("ru = 'Не удалось обновить сертификаты по ученой записи: %1'"), ИдентификаторЭДО));
			
	КонецПопытки;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - см. РегистрСведений.СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Сертификат - см. РегистрСведений.СертификатыУчетныхЗаписейЭДО.Сертификат
//  * ДействителенДо - см. РегистрСведений.СертификатыУчетныхЗаписейЭДО.ДействителенДо
//  * Доверенность - см. РегистрСведений.СертификатыУчетныхЗаписейЭДО.Доверенность
Функция СертификатыУчетнойЗаписи(ИдентификаторЭДО) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатыУчетныхЗаписейЭДО.Сертификат КАК Сертификат,
		|	СертификатыУчетныхЗаписейЭДО.ДействителенДо КАК ДействителенДо,
		|	СертификатыУчетныхЗаписейЭДО.Доверенность КАК Доверенность
		|ИЗ
		|	РегистрСведений.СертификатыУчетныхЗаписейЭДО КАК СертификатыУчетныхЗаписейЭДО
		|ГДЕ
		|	СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО = &ИдентификаторЭДО";
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Заполняет должность сотрудника (для подстановки в документы) использующего сертификат.
// 
// Параметры:
//  Набор - РегистрСведенийНаборЗаписей.СертификатыУчетныхЗаписейЭДО
//  ДолжностьПоСертификату - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  Записать - Булево
Процедура ОбработатьДанные_ЗаполнитьДолжность(Набор, ДолжностьПоСертификату, Записать)
	
	Для Каждого Запись Из Набор Цикл
		Если ЗначениеЗаполнено(ДолжностьПоСертификату) Тогда
			Запись.Должность = ДолжностьПоСертификату;
			Записать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Получает список должностей по сертификатам из двоичных данных данных сертификата
// Параметры:
//  Сертификаты - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * Значение - Строка, Неопределено - Должность
Функция ПолучитьДожностиИзДвочиныхДанныхСертификата(Сертификаты)
	
	ДолжностиИзДвоичныхДанныхСертификата = Новый Соответствие;
	Для Каждого КлючИЗначение Из КриптографияБЭД.СвойстваСертификатов(Сертификаты) Цикл
		Если Не ТипЗнч(КлючИЗначение.Значение.ДанныеСертификата) = Тип("ДвоичныеДанные") Тогда
			Продолжить;
		КонецЕсли;
		СертификатКриптографии = Новый СертификатКриптографии(КлючИЗначение.Значение.ДанныеСертификата);
		СвойстваСубъекта = КриптографияБЭД.СвойстваСубъектаСертификата(СертификатКриптографии);
		ДолжностиИзДвоичныхДанныхСертификата.Вставить(КлючИЗначение.Ключ, СвойстваСубъекта.Должность);
	КонецЦикла;
	
	Возврат ДолжностиИзДвоичныхДанныхСертификата;
	
КонецФункции

// Получает должность доверенного лица из действующих доверенностей организации
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Организация доверитель
//  Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования, СертификатКриптографии - Сертификат
//               доверенного лица.
// Возврщаемое значение:
//  Строка, Неопределено - Должность доверенного лица.
Функция ПолучитьДолжностьИзДоверенностейОрганизации(Организация, Сертификат)
	
	Должность = Неопределено;
	
	Отбор = МашиночитаемыеДоверенности.НовыйОтборМЧД();
	Отбор.Доверитель = Организация;
	Отбор.Сертификат = Сертификат;
	Доверенности = МашиночитаемыеДоверенности.ПолучитьДоверенностиОрганизации(Отбор);
	Для Каждого Доверенность Из Доверенности Цикл
		
		Если Не МашиночитаемыеДоверенности.ЭтоМЧД003(Доверенность) Тогда
			Продолжить;
		КонецЕсли;
		ДанныеXML = МашиночитаемыеДоверенности.ДанныеФайлаДоверенностиИПодписи(Доверенность);
		ДанныеДоверенности = МашиночитаемыеДоверенности.ОбъектXDTOМЧД(ДанныеXML.ДанныеФайла);
		Если ЗначениеЗаполнено(ДанныеДоверенности.ТекстОшибки) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоПередоверие = МашиночитаемыеДоверенности.ЭтоПередоверие(ДанныеДоверенности.ОбъектМЧД);
		Если Не ЭтоПередоверие Тогда
			ДанныеПредставителей = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДанныеДоверенности.ОбъектМЧД,
				"Документ.Довер.СвУпПред");
		Иначе
			ДанныеПредставителей = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДанныеДоверенности.ОбъектМЧД,
				"Документ.Передов.СвПолучПолн");
		КонецЕсли;
		
		Если ДанныеПредставителей = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДолжностьВДоверенности = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДанныеПредставителей[0], "Пред.СведФизЛ.Должность");
		Если ЗначениеЗаполнено(ДолжностьВДоверенности) Тогда
			Должность = ДолжностьВДоверенности;
		КонецЕсли;
		
	КонецЦикла;

	Возврат Должность;
	
КонецФункции

// Параметры:
//  Сертификаты - Массив из см. РегистрСведений.СертификатыУчетныхЗаписейЭДО.Сертификат
//  ИдентификаторыЭДО - Неопределено,Массив из см. РегистрСведений.СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - см. РегистрСведений.СертификатыУчетныхЗаписейЭДО.Сертификат
//  * Значение - Массив из см. РегистрСведений.СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО
Функция УчетныеЗаписиПоСертификатам(Сертификаты, ИдентификаторыЭДО = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	СертификатыУчетныхЗаписейЭДО.Сертификат КАК Сертификат
		|ИЗ
		|	РегистрСведений.СертификатыУчетныхЗаписейЭДО КАК СертификатыУчетныхЗаписейЭДО
		|ГДЕ
		|	СертификатыУчетныхЗаписейЭДО.Сертификат В (&Сертификаты)";
	
	Запрос.УстановитьПараметр("Сертификаты", Сертификаты);
	
	Если ЗначениеЗаполнено(ИдентификаторыЭДО) Тогда
		Запрос.Текст = Запрос.Текст + "
			|	И СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО В (&ИдентификаторыЭДО)";
		Запрос.УстановитьПараметр("ИдентификаторыЭДО", ИдентификаторыЭДО);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИдентификаторыЭДО = Результат[Выборка.Сертификат];
		Если ИдентификаторыЭДО = Неопределено Тогда
			ИдентификаторыЭДО = Новый Массив; // Массив из Строка
			Результат.Вставить(Выборка.Сертификат, ИдентификаторыЭДО);
		КонецЕсли;
		ИдентификаторыЭДО.Добавить(Выборка.ИдентификаторЭДО);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
